In [0]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Flatten,Dense

In [0]:
 import numpy as np
 import pandas as pd
 from sklearn.model_selection import train_test_split

In [0]:
dataset=pd.read_csv('/content/Churn_Modelling.csv')

In [9]:
dataset.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [0]:
x=dataset.drop(labels=['CustomerId','Surname','RowNumber'],axis=1)

In [0]:
y=dataset['Exited']

In [12]:
x.head()

   CreditScore Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619    France  Female  ...               1        101348.88       1
1          608     Spain  Female  ...               1        112542.58       0
2          502    France  Female  ...               0        113931.57       1
3          699    France  Female  ...               0         93826.63       0
4          850     Spain  Female  ...               1         79084.10       0

[5 rows x 11 columns]

In [0]:
from sklearn.preprocessing import LabelEncoder

In [0]:
label1=LabelEncoder()

In [0]:
x['Geography']=label1.fit_transform(x['Geography'])

In [16]:
x.head()

   CreditScore  Geography  Gender  ...  IsActiveMember  EstimatedSalary  Exited
0          619          0  Female  ...               1        101348.88       1
1          608          2  Female  ...               1        112542.58       0
2          502          0  Female  ...               0        113931.57       1
3          699          0  Female  ...               0         93826.63       0
4          850          2  Female  ...               1         79084.10       0

[5 rows x 11 columns]

In [0]:
label2=LabelEncoder()

In [0]:
x['Gender']=label2.fit_transform(x['Gender'])

In [19]:
x=pd.get_dummies(x,drop_first=True,columns=['Geography'])
x.head()

   CreditScore  Gender  Age  ...  Exited  Geography_1  Geography_2
0          619       0   42  ...       1            0            0
1          608       0   41  ...       0            0            1
2          502       0   42  ...       1            0            0
3          699       0   39  ...       0            0            0
4          850       0   43  ...       0            0            1

[5 rows x 12 columns]